app/Controllers/Inicio.php

SELECT *
FROM `persona`
WHERE `email` = 'pablo@mail.com'
AND `contrasena` = '827ccb0eea8a706c4c34a16891f84e7b'
---
    public function validarDatosIngreso()
    {
        $correo = $this->request->getPostGet('correo');
        $contrasena =  md5($this->request->getPostGet('contrasena'));
        $mensaje = "";
        $personaModel = new PersonaModel();
        // cosnultamos el usario con la contraseña y correo ingresados en la vista
        $registros = $personaModel->where(['email' => $correo, 'contrasena' => $contrasena])->find();